# Типы данных питоне;
# 1.NoneType -> Ничего ,пустота
#None #NoneType

#a = None
#print(a)

# 2. Boolean -> Правда или Ложь (True/False)
# True = 1
# False = 0
# 3. Числовые типы данных;
#      a. integer(int) -> Целое число (1,2,3)
#      b. float() -> Число с плавающей точкой (1.2, 10.20, 2.7)
#      c. complex() -> комплексные числа(2 + 5i/j)
#4 . Списклвые типы данных:
    #    a. list(список/массив) -> [1, 2, 3, True, None]
    #    b. tuple(кортеж) -> (1,2,3,False)
    # c. range(последовательность) -> range(1,5) -> 1,2,3,4
#5. string(str)  сторка -> "Hello World"
#                          'Hello World'
# jone = 'My name is Jone!'  
# 6. set() Множество
# 7. dict (Словари) -> содержит данные в виде ключа:значение -> {1: 'one', 2: 'two'}
 
 
# ----------------------------------------------------------------------------------


# Mutable(изменяемые типы данных)
# 1. list()
# 2. set()
# 3. dict()

#Immutable(неизменяемые типы данных)
# 1. Nonw()
# 2. bool()
# 3. int(), float(), complex()
# 4. str()
# 5. range()
# 6. tuple()
"""
в пайтоне для вывода данных в терминал используется функция print()
"""
print('hello KUTMAN')
    #стандартный ввод данных
'''
для ввода используется функция input()
'''
# a = input ('Введите число: ')
# print (a)
# #type a
# print (type(a))

# b = int(input ("введите число номер 2: "))
# print(b)
# print(type(b))