GIT-Распределеная система контроля версий
Это система для отслеживенеи и ведение историй изменений вашихфайлов или проеекта 

Репеозиторий - хранилище ваших файлов, которые вы отслеживаете при помощи гита ,и их изменений.

Команды Git:

1. git init - она создает новый гит репозиторий локально на вашем пк, создаст она в той директории где вы запускаете эту командую

2.git add - когда мы создаем и изменяем файлы б то при помощи это команды мы загружаем вссе изменеиния промежуточное место хранилище

git add<file_name>
git add.->все в текущей директории

3. git commit - как только мы достигаем определенного момента вразработки б то мы сохраняем и комментируем все наши измениения в репозиторийю
(фиксация изменений в репо.)

git commit -m '<comment>'

   git --version

   sudo apt install git
   
   git config --global user.name "general-kg"
   git config --global user.email "kutmanvip01@gmail.com"
   git config --list
   
   
   cd .ssh
   ls




